"In order to find a matching part, the fitting has to be connected to a duct."
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedError { get; }
  Visual Basic
Public Shared ReadOnly Property PartNotFoundDueToNoDuctConnectedError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PartNotFoundDueToNoDuctConnectedError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DuctFailures Class
  Autodesk.Revit.DB Namespace